[{"source":{"id":null,"name":"Daily Mail"},"author":"By Dailymail.com Reporter","title":"Jersey Shore: Nicole 'Snooki' Polizzi departs show at Angelina Pivarnick's wedding in season finale - Daily Mail","description":"The 32-year-old reality star bid farewell to her Jersey Shore roommates on Thursday's season finale ending more than a decade of filming reality shows.","url":"https://www.dailymail.co.uk/tvshowbiz/article-8438771/Jersey-Shore-Nicole-Snooki-Polizzi-departs-Angelina-Pivarnicks-wedding-season-finale.html","urlToImage":"https://i.dailymail.co.uk/1s/2020/06/19/06/29805604-0-image-a-55_1592543401081.jpg","publishedAt":"2020-06-19T14:26:47Z","content":"Nicole 'Snooki' Polizzi broke down into tears as she quit the Jersey Shore on Thursday's season finale, ending more than a decade of filming reality shows with the crew.  \r\nThe cast's beloved 'meatba… [+11133 chars]"},{"source":{"id":null,"name":"New York Post"},"author":"Zachary Kussin","title":"Matt Damon isn't happy Jimmy Kimmel is taking a break from talk show - New York Post ","description":"Matt Damon, in an appearance on “Jimmy Kimmel Live!,” has some words for the longtime late-night host.","url":"https://nypost.com/2020/06/19/matt-damon-isnt-happy-jimmy-kimmel-is-taking-a-break-from-show/","urlToImage":"https://nypost.com/wp-content/uploads/sites/2/2020/06/damon-kimmel.jpg?quality=90&strip=all&w=1200","publishedAt":"2020-06-19T14:17:49Z","content":"Jimmy Kimmel may be committed to his family, but he’s bailing on his long-running gag with Matt Damon.\r\nIn a clip from Thursday’s episode of “Jimmy Kimmel Live!,” in which the late-night host details… [+1595 chars]"},{"source":{"id":null,"name":"Showbiz Cheat Sheet"},"author":"Aramide Tinubu","title":"Kim Kardashian and Kanye West's Daughter North West Just Turned 7 but Her Net Worth Is Insane - Showbiz Cheat Sheet","description":"Kim Kardashian West and Kanye West's eldest daughter North West is only 7, but she has a huge personality. She also has an insane net worth.","url":"https://www.cheatsheet.com/entertainment/north-west-net-worth.html/","urlToImage":"https://www.cheatsheet.com/wp-content/uploads/2019/05/scs-icon.png","publishedAt":"2020-06-19T13:56:13Z","content":"From almost the moment she was born, Kim Kardashian West and Kanye West‘s eldest daughter, North West has dazzled us all. From her iconic fashion sense to her legendary appearances at major fashion s… [+3556 chars]"}]
